/**
  ******************************************************************************
  * @file    temt6000.h
  * @author  Smart Greenhouse Project
  * @version V1.0
  * @date    2024
  * @brief   TEMT6000光照传感器驱动头文件
  ******************************************************************************
  */

#ifndef __TEMT6000_H
#define __TEMT6000_H

/* Includes ------------------------------------------------------------------*/
#include "stm32f10x.h"

/* Exported functions --------------------------------------------------------*/
void TEMT6000_Init(void);
uint16_t TEMT6000_Read(void);

#endif /* __TEMT6000_H */
